stm32mpu-oem/STM32CubeMP2/Middlewares/ST/STM32_USBPD_Library/UCSI/ppm.c
/* Local variable to store port status */
uint8_t CurrentPort;
uint8_t AsynchEventPending  = 0;
uint8_t CommandPending      = 0;

__IO PPM_STATE PPM_State         = PPM_IDLE_NOT_READY;
__IO PPM_STATE PPM_PreviousState = PPM_IDLE_NOT_READY;



/* Private function prototypes -----------------------------------------------*/
/** @defgroup USBPD_CORE_PPM_Private_Functions USBPD CORE PPM Private Functions
  * @{
  */
static void                PPM_ManageCommandNotReady(PUCSI_CONTROL_t PtrControl);
static void                PPM_ManageCommandReady(PUCSI_CONTROL_t PtrControl);
static void                PPM_NotifyOPM(uint32_t Command, uint32_t Event);
static USBPD_StatusTypeDef PPM_FillDefaultConfiguration(void);
static USBPD_StatusTypeDef PPM_FillConnectorCapability(uint8_t PortNumber,
                                                        PUCSI_GET_CONNECTOR_CAPABILITY_IN_t PtrConnectorCapability);
static USBPD_StatusTypeDef PPM_Reset(void);
static USBPD_StatusTypeDef PPM_Cancel(void);
static USBPD_StatusTypeDef PPM_ConnectorReset(uint8_t PortNumber, uint8_t HardReset);
static USBPD_StatusTypeDef PPM_AckCcCi(uint8_t ConnectorChangeAck, uint8_t CommandCompletedAck);
static USBPD_StatusTypeDef PPM_SetNotificationEnable(uint16_t SetNotificationEnable);
static USBPD_StatusTypeDef PPM_GetCapabilityStatus(void);
static USBPD_StatusTypeDef PPM_GetConnectorCapabilityStatus(uint8_t PortNumber);
#if FEATURE_SET_UOM_SUPPORTED
static USBPD_StatusTypeDef PPM_SetCC_OperationMode(uint8_t PortNumber, UCSI_CC_OPERATION_MODE_t Mode);
#endif /* FEATURE_SET_UOM_SUPPORTED */
static USBPD_StatusTypeDef PPM_SetUSB_OperationRole(uint8_t PortNumber, UCSI_USB_OPERATION_ROLE_t Role);
#if FEATURE_SET_PDM_SUPPORTED
static USBPD_StatusTypeDef PPM_SetPowerDirectionMode(uint8_t PortNumber, UCSI_POWER_DIRECTION_MODE_t PowerMode);
#endif /* FEATURE_SET_PDM_SUPPORTED */
static USBPD_StatusTypeDef PPM_SetPowerDirectionRole(uint8_t PortNumber, UCSI_POWER_DIRECTION_ROLE_t PowerRole);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
static USBPD_StatusTypeDef PPM_GetAlternateModes(uint8_t PortNumber,
                                                  PUCSI_GET_ALTERNATE_MODES_COMMAND PtrGetAlternatesModes);
static USBPD_StatusTypeDef PPM_GetCamSupported(uint8_t PortNumber);
static USBPD_StatusTypeDef PPM_GetCurrentCam(uint8_t PortNumber);
#if FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED
static USBPD_StatusTypeDef PPM_SetNewCam(uint8_t PortNumber, uint8_t EnterOrExit, uint8_t NewCAM, uint32_t AMSpecific);
#endif /* FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED */
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
#if FEATURE_PDODETAILS_SUPPORTED
static USBPD_StatusTypeDef PPM_GetPDOs(uint8_t PortNumber, PUCSI_GET_PDOS_COMMAND_t PtrGetPdos);
#endif /* FEATURE_PDODETAILS_SUPPORTED */
#if FEATURE_CABLEDETAILS_SUPPORTED
static USBPD_StatusTypeDef PPM_GetCableProperty(uint8_t PortNumber);
#endif /* FEATURE_CABLEDETAILS_SUPPORTED */
static USBPD_StatusTypeDef PPM_GetConnectorStatus(uint8_t PortNumber);
static USBPD_StatusTypeDef PPM_GetErrorStatus(void);
#if FEATURE_SET_POWER_LEVEL_SUPPORTED
static USBPD_StatusTypeDef PPM_SetPowerLevel(PUCSI_SET_POWER_LEVEL_COMMAND PtrSetPowerLevel);
#endif /* FEATURE_SET_POWER_LEVEL_SUPPORTED */
#if FEATURE_GET_PD_MESSAGE_SUPPORTED
static USBPD_StatusTypeDef PPM_GetPDMessage(PUCSI_GET_PD_MESSAGE_COMMAND PtrGetPDMessage);
#endif /* FEATURE_GET_PD_MESSAGE_SUPPORTED */
static USBPD_StatusTypeDef PPM_UnknownCommand(uint8_t PortNumber);

extern uint32_t HAL_GetTick(void);

/**
  * @}
  */


/** @defgroup USBPD_CORE_PPM_Exported_Functions USBPD CORE PPM Exported Functions
  * @{
  */
#define UCSI_CONNECTOR_IDLE   0x00U
#define UCSI_CONNECTOR_CHANGE 0x01U
uint8_t ConnectorChange[USBPD_PORT_COUNT];

/**
  * @brief  Initialize the default configuration used by the USB-PD stack
  * @retval USBPD status
  */
#if defined(USBPD_THREADX)
USBPD_StatusTypeDef USBPD_PPM_Init(VOID *MemoryPtr)
#else
USBPD_StatusTypeDef USBPD_PPM_Init(void)
#endif /* USBPD_THREADX */
{
  uint32_t index;
  PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_INIT, NULL, 0U);

  /* Initialize command lists */
  PPM_Handle.Error                  = 0U;
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  PPM_FillDefaultConfiguration();

  /* Initialize each USB-PD connector capability */
  for (index = 0; index < USBPD_PORT_COUNT; index++)
  {
    PPM_FillConnectorCapability(index, &PPM_Handle.ConnectorCapability[index]);
    ConnectorChange[index] = UCSI_CONNECTOR_IDLE;
  }

#if defined(_RTOS) || defined(USBPD_THREADX)
  OS_INIT();
  OS_CREATE_QUEUE(PPMMsgBox, "PPM", PPM_BOX_MESSAGES_MAX, sizeof(uint32_t));
  OS_DEFINE_TASK(PPM, USBPD_PPM_UserExecute, OS_PPM_PRIORITY, OS_PPM_STACK_SIZE, &PPMMsgBox);
  OS_CREATE_TASK(PPMThread, PPM, USBPD_PPM_UserExecute, OS_PPM_PRIORITY, OS_PPM_STACK_SIZE, &PPMMsgBox);
#else
#warning "NRTOS Version not implemented"
#endif /* _RTOS || USBPD_THREADX */

  (void)_retr; /* To avoid gcc/g++ warnings */
  return USBPD_OK;
#if defined(_RTOS) || defined(USBPD_THREADX)
error:
  return USBPD_ERROR;
#endif /* _RTOS || USBPD_THREADX */
}

#if defined(_RTOS) || defined(USBPD_THREADX)
DEF_TASK_FUNCTION(USBPD_PPM_UserExecute)
{
#if defined(USBPD_THREADX)
  uint32_t _timing = TX_WAIT_FOREVER;
#elif defined(_RTOS)
  uint32_t _timing = osWaitForever;
#endif /* USBPD_THREADX */
  static uint32_t tickstart = 0;

   OS_QUEUE_ID *queue = (OS_QUEUE_ID *)argument;

  do
  {
#if defined(USBPD_THREADX)
    ULONG event = 0;
    tx_queue_receive(queue, (void*)&event, _timing);
    switch (((PPM_USER_EVENT)event & MASK_EVENT))
#elif defined(_RTOS)
#if (osCMSIS < 0x20000U)
    osEvent event = osMessageGet(queue, _timing);
    switch (((PPM_USER_EVENT)event.value.v & MASK_EVENT))
#else
    uint32_t event;
    (void)osMessageQueueGet(queue, &event, NULL, _timing);
    switch (((PPM_USER_EVENT)event & MASK_EVENT))
#endif /* osCMSIS < 0x20000U */
#endif /* USBPD_THREADX */
    {
      case PPM_USER_EVENT_COMMAND:
      {
        PUCSI_CONTROL_t ptr_control = (PUCSI_CONTROL_t)&PPM_Handle.Control;
        switch (PPM_State)
        {
          case PPM_IDLE_NOT_READY:             /* PPM Idle (notification disabled) */
            PPM_ManageCommandNotReady(ptr_control);
            break;
          default:
            PPM_ManageCommandReady(ptr_control);
            break;
        }
        break;
      }
      case PPM_USER_EVENT_NOTIFICATION:
      case PPM_USER_EVENT_NONE:
      case PPM_USER_EVENT_TIMER:
      default:
        break;
    }

    /* Manage PPM State Machine */
    switch (PPM_State)
    {
      case PPM_IDLE_READY:                 /* PPM Idle (notification enabled) */
        /* Save time, for timeout mechanism */
        tickstart = HAL_GetTick();
        if (0U != AsynchEventPending)
        {
          SWITCH_TO_PPM_STATE(PPM_WAIT_FOR_ASYNCH_EVENT_ACK);
        }
        break;
      case PPM_IDLE_NOT_READY:             /* PPM Idle (notification disabled) */
        AsynchEventPending = 0U;
        break;
      case PPM_WAIT_FOR_ASYNCH_EVENT_ACK:  /* Wait for asynch event ack */
        if (0U != AsynchEventPending)
        {
          /** Acknowledge Command Indicator:
            * The PPM shall set this field to one when it completes the ACK_CC_CI
            * (Acknowledge Command Completion and/or Change Indication) command. The PPM shall automatically reset this
            * bit when it receives the next command from the OPM.
            * If this field is set to one, then the only other field that can be set is the Connector Change
            * Indicator field.
            */
          PPM_Handle.AckCCI_Status.AsUInt32 &= 0x20000000U;

