stm32mpu-oem/STM32CubeMP2/Middlewares/ST/STM32_USBPD_Library/UCSI/ppm.c
          PPM_Handle.AckCCI_Status.ConnectorChangeIndicator = AsynchEventPending;
          if (PPM_Handle.Error == 1U)
          {
            PPM_Handle.AckCCI_Status.ErrorIndicator = 1U;
            PPM_Handle.Error = 0U;
          }
          PPM_NotifyOPM(0U, 1U);
          PPM_TRACE(PPM_DEBUG_LEVEL_1, UCSI_TRACE_PPM_EVENT, (uint8_t *)&PPM_Handle.AckCCI_Status.AsUInt32, 4U);
          /* Clear Async event pending */
          AsynchEventPending = 0U;
        }
        break;
      case PPM_BUSY:                       /* PPM Busy                        */
      case PPM_PROCESSING_COMMAND:         /* Processing command              */
      case PPM_WAIT_FOR_CMD_COMPL_ACK:     /* Wait for command completion ack */
        if (PPM_Handle.AckCCI_Status.AcknowledgeCommandIndicator != 0U)
        {
          /* Switch to PPM Idle (Notification enabled) */
          SWITCH_TO_PPM_STATE(PPM_IDLE_READY);
        }
        else
        {
          /* Manage timeout in case OPM never ack command */
            if ((HAL_GetTick() - tickstart) > PPM_WAIT_ACK_TIMEOUT) /* 1s timeout */
            {
              PPM_DEBUG(PPM_DEBUG_LEVEL_1, USBPD_PORT_0,
                        "PPM_WAIT_FOR_CMD_COMPL_ACK timeout. Switching to state PPM_IDLE_READY");

              /* Abort waiting */
              PPM_Handle.AckCCI_Status.AcknowledgeCommandIndicator = 1U;
              SWITCH_TO_PPM_STATE(PPM_IDLE_READY);
            }
        }
        break;
      default:
        break;
    }

    if (0U != AsynchEventPending)
    {
      /* 2 Asynch has been raised. 1st one has been correctly managed. */
#if defined(USBPD_THREADX)
      _timing = TX_NO_WAIT;
#elif defined(_RTOS)
      _timing = 0U;
#endif /* USBPD_THREADX */
    }
    else
    {
#if defined(USBPD_THREADX)
      _timing = TX_WAIT_FOREVER;
#elif defined(_RTOS)
      _timing = osWaitForever;
#endif /* USBPD_THREADX */
    }
  } while (1);
}
#else
#warning "NRTOS Version not implemented"
#endif /* _RTOS || USBPD_THREADX */

/**
  * @brief  Get data pointer saved in PPM Handle
  * @param  Register
  * @retval Pointer of data
  */
uint8_t *USBPD_PPM_GetDataPointer(UCSI_REG_t Register)
{
#if defined(_TRACE)
  if (Register < UcsiRegDataStructureUnkown)
  {
    PPM_TRACE(PPM_DEBUG_LEVEL_2, UCSI_TRACE_PPM_GET_REG, (uint8_t *)&Register, 1U);
  }
#endif /* _TRACE */
  uint8_t *ptr = NULL;
  switch (Register)
  {
    case UcsiRegDataStructureVersion:
      ptr = (uint8_t *)&PPM_Handle.UcsiVersion;
      break;
    case UcsiRegDataStructureCci:
      ptr = (uint8_t *)&PPM_Handle.AckCCI_Status;
      break;
    case UcsiRegDataStructureControl:
      ptr = (uint8_t *)&PPM_Handle.Control;
      break;
    case UcsiRegDataStructureMessageIn:
      ptr = (uint8_t *)&PPM_Handle.MessageIn;
      PPM_TRACE(PPM_DEBUG_LEVEL_1, UCSI_TRACE_PPM_GET_REG, (uint8_t *)&PPM_Handle.MessageIn, UCSI_MAX_DATA_LENGTH);
      break;
    case UcsiRegDataStructureMessageOut:
      ptr = (uint8_t *)&PPM_Handle.MessageOut;
      break;
    case UcsiRegDataStructureUnkown:
    case UcsiRegDataStructureReserved:
    default:
      PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_GET_REG_ERROR_READ, (uint8_t *)&PPM_Handle.AckCCI_Status.AsUInt32, 4U);
      break;
  }

  return ptr;
}

/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  PortNumber  The current port number
  * @param  EventVal    USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void USBPD_PPM_Notification(uint8_t PortNumber, uint32_t EventType)
{
  /*
  Mandatory:
  PPM_Handle.SetNotificationEnable.CommandComplete;
  PPM_Handle.SetNotificationEnable.PowerOperationModeChange;
  PPM_Handle.SetNotificationEnable.BatteryChargingStatusChange;
  PPM_Handle.SetNotificationEnable.ConnectorPartnerChange;
  PPM_Handle.SetNotificationEnable.PowerDirectionChange;
  PPM_Handle.SetNotificationEnable.ConnectChange;
  PPM_Handle.SetNotificationEnable.Error;

  Optional: */
#if FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED
  PPM_Handle.SetNotificationEnable.ExternalSupplyChange;
#endif /* FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED */
#if FEATURE_PDODETAILS_SUPPORTED
  PPM_Handle.SetNotificationEnable.SupportedProviderCapabilitiesChange = 1U;
  PPM_Handle.SetNotificationEnable.NegotiatedPowerLevelChange = 1U;
#endif /* FEATURE_PDODETAILS_SUPPORTED */
#if FEATURE_PDRESETNOTIFICATION_SUPPORTED
  PPM_Handle.SetNotificationEnable.PdResetComplete;
#endif /* FEATURE_PDRESETNOTIFICATION_SUPPORTED */
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
  PPM_Handle.SetNotificationEnable.SupportedCamChange;
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */

  if (PPM_Handle.SetNotificationEnable.ConnectChange != 0U)
  {
    switch (EventType)
    {
      case USBPD_NOTIFY_DATAROLESWAP_NOT_SUPPORTED:
        PPM_Handle.Error                  = 1U;
      /* Event for attach */
      case USBPD_NOTIFY_POWER_EXPLICIT_CONTRACT:
      /* Event for detach */
      case USBPD_NOTIFY_DETACH:
      /* Event for Data Role Swap  */
      case USBPD_NOTIFY_DATAROLESWAP_UFP:
      case USBPD_NOTIFY_DATAROLESWAP_DFP:
      case USBPD_NOTIFY_USBSTACK_START:
      case USBPD_NOTIFY_PE_DISABLED:
      /* A notification has been detected */
      {
        uint32_t event = SET_PORT_EVENT(PortNumber, PPM_USER_EVENT_NOTIFICATION);
        ConnectorChange[PortNumber] = UCSI_CONNECTOR_CHANGE;
        /* Wake up PPM only if there are no pending Asynck event */
        if (AsynchEventPending == 0U)
        {
          AsynchEventPending = (PortNumber + 1U);
#if defined(USBPD_THREADX)
          ULONG _msg = event;
          if (TX_SUCCESS != tx_queue_send(&PPMMsgBox, &_msg, 0U))
          {
            PPM_DEBUG(PPM_DEBUG_LEVEL_0, 0U, "COMMAND: MB FULL\r\n");
          }
#elif defined(_RTOS)
#if (osCMSIS < 0x20000U)
          if (osOK != osMessagePut(PPMMsgBox, event, 0U))
          {
            PPM_DEBUG(PPM_DEBUG_LEVEL_0, PortNumber, "NOTIF1: MB FULL\r\n");
          }
#else
          (void)osMessageQueuePut(PPMMsgBox, &event, 0U, NULL);
#endif /* osCMSIS < 0x20000U */
#else
#warning " NRTOS Version not implemented"
#endif /* USBPD_THREADX */
        }
      }
      break;

      default:
        break;
    }
  }

  /* No notifications match */
  return;
}

void USBPD_PPM_PostCommand(void)
{
  uint32_t event = PPM_USER_EVENT_COMMAND;
#if defined(USBPD_THREADX)
  ULONG _msg = event;
  if (TX_SUCCESS != tx_queue_send(&PPMMsgBox, &_msg, 0U))
  {
    PPM_DEBUG(PPM_DEBUG_LEVEL_0, 0U, "COMMAND: MB FULL\r\n");
  }
#elif defined(_RTOS)
#if (osCMSIS < 0x20000U)
  if (osOK != osMessagePut(PPMMsgBox, event, 0U))
  {
    PPM_DEBUG(PPM_DEBUG_LEVEL_0, 0U, "COMMAND: MB FULL\r\n");
  }
#else
  (void)osMessageQueuePut(PPMMsgBox, &event, 0U, NULL);
#endif /* osCMSIS < 0x20000U */
#else
#warning " NRTOS Version not implemented"
#endif /* USBPD_THREADX */
  /* PPM Update Command Pending */
  CommandPending = 1U;
}

/**
  * @}
  */

/** @addtogroup USBPD_CORE_PPM_Private_Functions
  * @{
  */
static void PPM_ManageCommandNotReady(PUCSI_CONTROL_t PtrControl)
{
  UCSI_COMMAND_t command = (UCSI_COMMAND_t)PtrControl->Command;
  PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_NOT_READY, (uint8_t *)PtrControl, 8U);
  if (UcsiCommandPpmReset == command)
  {
    /* Disable all the notifications */
    PPM_Reset();
  }
  else if (UcsiCommandSetNotificationEnable == command)
  {
    PPM_SetNotificationEnable(PtrControl->SetNotificationEnable.Content.NotificationEnable);

    PPM_NotifyOPM(1U, 0U);
    SWITCH_TO_PPM_STATE(PPM_WAIT_FOR_CMD_COMPL_ACK);
  }
  else
  {
    /* Nothing to do */
  }

