stm32mpu-oem/STM32CubeMP2/Middlewares/ST/STM32_USBPD_Library/UCSI/ppm.c
  /* Clear Command pending */
  CommandPending = 0U;
}

static void PPM_ManageCommandReady(PUCSI_CONTROL_t PtrControl)
{
  UCSI_COMMAND_t command = (UCSI_COMMAND_t)PtrControl->Command;
  PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY, (uint8_t *)PtrControl, 8U);

  if (UcsiCommandPpmReset == command)
  {
    /* Disable all the notifications */
    PPM_Reset();
  }
  else if (UcsiCommandCancel == command)
  {
    /* Cancel current operation if not yet processing */
    PPM_Cancel();

    /* Notificy OPM */
    PPM_NotifyOPM(1U, 0U);
  }
  else
  {
    /* if PPM is busy or command need to take more one UCSI_MIN_TIME_TO_RESPOND_WITH_BUSY ms set busy indicator */
    if (PPM_BUSY == PPM_State) /* || Cmd Need UCSI_MIN_TIME_TO_RESPOND_WITH_BUSY */
    {
      /* Reset Status variable */
      PPM_Handle.AckCCI_Status.AsUInt32 = 0U;
      /* Acknowledge the command */
      PPM_Handle.AckCCI_Status.BusyIndicator = 1U;
      /* Notificy OPM */
      PPM_NotifyOPM(1U, 0U);
      SWITCH_TO_PPM_STATE(PPM_PROCESSING_COMMAND);
    }
    else
    {
      switch (command)
      {
        case UcsiCommandConnectorReset:
          CurrentPort = (uint8_t)(PtrControl->ConnectorReset.ConnectorNumber - 1U);
          PPM_ConnectorReset(CurrentPort, (uint8_t)PtrControl->ConnectorReset.HardReset);
          break;
        case UcsiCommandAckCcCi:
          CurrentPort = (uint8_t)(PtrControl->ConnectorReset.ConnectorNumber - 1U);
          PPM_AckCcCi((uint8_t)PtrControl->AckCcCi.ConnectorChangeAcknowledge, (uint8_t)PtrControl->AckCcCi.CommandCompletedAcknowledge);
          break;
        case UcsiCommandSetNotificationEnable:
          PPM_SetNotificationEnable(PtrControl->SetNotificationEnable.Content.NotificationEnable);
          break;
        case UcsiCommandGetCapability:
          PPM_GetCapabilityStatus();
          break;
        case UcsiCommandGetConnectorCapability:
          CurrentPort = (uint8_t)(PtrControl->GetConnectorCapability.ConnectorNumber - 1U);
          PPM_GetConnectorCapabilityStatus(CurrentPort);
          break;
        case UcsiCommandSetUor:
          CurrentPort = (uint8_t)(PtrControl->SetUor.ConnectorNumber - 1U);
          PPM_SetUSB_OperationRole(CurrentPort, (UCSI_USB_OPERATION_ROLE_t)PtrControl->SetUor.UsbOperationRole);
          break;
        case UcsiCommandSetPdr:
          CurrentPort = (uint8_t)(PtrControl->SetPdr.ConnectorNumber - 1U);
          PPM_SetPowerDirectionRole(CurrentPort, (UCSI_POWER_DIRECTION_ROLE_t)PtrControl->SetPdr.PowerDirectionRole);
          break;
        case UcsiCommandGetConnectorStatus:
          CurrentPort = (uint8_t)(PtrControl->GetConnectorStatus.ConnectorNumber - 1U);
          PPM_GetConnectorStatus(CurrentPort);
          break;
        case UcsiCommandGetErrorStatus:
          PPM_GetErrorStatus();
          break;
        case UcsiCommandSetCCom:
          CurrentPort = (uint8_t)(PtrControl->SetUom.ConnectorNumber - 1U);
#if FEATURE_SET_UOM_SUPPORTED
          PPM_SetCC_OperationMode(CurrentPort, (UCSI_CC_OPERATION_MODE_t)PtrControl->SetUom.UsbOperationMode);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_SET_UOM_SUPPORTED */
          break;
        /* Obsolete from Rev1.2, Jan20*/
        case UcsiCommandSetPdm:
          CurrentPort = (uint8_t)(PtrControl->SetPdm.ConnectorNumber - 1U);
#if FEATURE_SET_PDM_SUPPORTED
          PPM_SetPowerDirectionMode(CurrentPort, (UCSI_POWER_DIRECTION_MODE_t)PtrControl->SetPdm.PowerDirectionMode);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_SET_PDM_SUPPORTED */
          break;
        case UcsiCommandGetAlternateModes:
          CurrentPort = (uint8_t)(PtrControl->GetAlternateModes.ConnectorNumber - 1U);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
          PPM_GetAlternateModes(CurrentPort, &PtrControl->GetAlternateModes);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
          break;
        case UcsiCommandGetCamSupported:
          CurrentPort = (uint8_t)(PtrControl->GetCamSupported.ConnectorNumber - 1U);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
          PPM_GetCamSupported(CurrentPort);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
          break;
        case UcsiCommandGetCurrentCam:
          CurrentPort = (uint8_t)(PtrControl->GetCurrentCam.ConnectorNumber - 1U);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
          PPM_GetCurrentCam(CurrentPort);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
          break;
        case UcsiCommandSetNewCam:
          CurrentPort = (uint8_t)(PtrControl->SetNewCam.ConnectorNumber - 1U);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED && FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED
          PPM_SetNewCam(CurrentPort, PtrControl->SetNewCam.EnterOrExit, PtrControl->SetNewCam.NewCam,
                        PtrControl->SetNewCam.AmSpecific);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED && FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED */
          break;
        case UcsiCommandGetPdos:
          CurrentPort = (uint8_t)(PtrControl->GetPdos.ConnectorNumber - 1U);
#if FEATURE_PDODETAILS_SUPPORTED
          PPM_GetPDOs(CurrentPort, &PtrControl->GetPdos);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_PDODETAILS_SUPPORTED */
          break;
        case UcsiCommandGetCableProperty:
          CurrentPort = (uint8_t)(PtrControl->GetCableProperty.ConnectorNumber - 1U);
#if FEATURE_CABLEDETAILS_SUPPORTED
          PPM_GetCableProperty(CurrentPort);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_CABLEDETAILS_SUPPORTED */
          break;
        case UcsiCommandSetPowerLevel:
          CurrentPort = (uint8_t)(PtrControl->SetPowerLevel.ConnectorNumber - 1U);
#if FEATURE_SET_POWER_LEVEL_SUPPORTED
          PPM_SetPowerLevel(PtrControl->SetPowerLevel);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_SET_POWER_LEVEL_SUPPORTED */
          break;
        case UcsiCommandGetPDMessage:
          CurrentPort = (uint8_t)(PtrControl->GetPDMessage.ConnectorNumber - 1U);
#if FEATURE_GET_PD_MESSAGE_SUPPORTED
          PPM_GetPDMessage(PtrControl->GetPDMessage);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_GET_PD_MESSAGE_SUPPORTED */
          break;
        default:
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
          break;
      }
      /* Notificy OPM */
      PPM_NotifyOPM(1U, 0U);
      SWITCH_TO_PPM_STATE(PPM_WAIT_FOR_CMD_COMPL_ACK);
    }
  }
  /* Clear Command pending */
  CommandPending = 0U;
}

