stm32mpu-oem/STM32CubeMP2/Middlewares/ST/STM32_USBPD_Library/UCSI/ppm.c
static void PPM_NotifyOPM(uint32_t Command, uint32_t Event)
{
  /* Prevent unused argument compilation warning */
  (void)Event;

  /* Notify OPM only if "Command Completed" notification is enabled */
  if (1U == Command)
  {
    /* Notify only if Command complete is enabled */
    if (1U == PPM_Handle.SetNotificationEnable.CommandComplete)
    {
      USBPD_UCSI_SendNotification(CurrentPort);
    }
  }
  else
  {
    /* Check if associated events is enabled */
    USBPD_UCSI_SendNotification(CurrentPort);
  }
  /* Cleart the ALERT */
  USBPD_UCSI_ClearAlert(CurrentPort);
}

/**
  * @brief  Manage reception of PPM_RESET message (Required)
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_Reset(void)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.ResetCompletedIndicator = 1U;

  /* Disable all the notifications */
  PPM_Handle.SetNotificationEnable.NotificationEnable = 0x0000U;

  /* USB Operation Mode should be reset as default value DRP
    (can be changed with Set USB Operation Mode command) */
  for (uint32_t index = 0U; index < USBPD_PORT_COUNT; index++)
  {
    PPM_Handle.CC_Mode[index] = (UCSI_CC_OPERATION_MODE_t)(PPM_Handle.ConnectorCapability[index].OperationMode.AsUInt8 &
                                                           0x07U);
  }

  /* Switch state to PPM Idle (Notifications disabled) */
  SWITCH_TO_PPM_STATE(PPM_IDLE_NOT_READY);

  return USBPD_OK;
}

/**
  * @brief  Manage reception of CANCEL message (Required)
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_Cancel(void)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CancelCompletedIndicator  = 1U;
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  return USBPD_OK;
}

/**
  * @brief  Manage reception of CONNECTOR_RESET message (Required)
  * @param  PortNumber Port Number value
  * @param  HardReset  Request an hard or soft reset
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_ConnectorReset(uint8_t PortNumber, uint8_t HardReset)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  if (HardReset != 0U)
  {
    /* Send a hard reset */
    USBPD_DPM_RequestHardReset(PortNumber);
  }
  else
  {
    /* Send a soft reset */
    /* Soft reset cannot be initiated by application. This is only a protocol error detected by the stack */
  }

  return USBPD_OK;
}

/**
  * @brief  Manage reception of ACK_CC_CCI message (Required)
  * @param  ConnectorChangeAck  Acknowledge a connector change
  * @param  CommandCompletedAck Acknowledge a command completed
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_AckCcCi(uint8_t ConnectorChangeAck, uint8_t CommandCompletedAck)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.AcknowledgeCommandIndicator = 1U;

  /* Prevent unused argument compilation warning */
  (void)CommandCompletedAck;

  /* Reset the ConnectorStatusChange */
  (&PPM_Handle.MessageIn.ConnectorStatus)->ConnectorStatusChange.AsUInt16 = 0x0000U;

  if (ConnectorChangeAck != 0U)
  {
    uint8_t index;
    for (index = 0U; index < USBPD_PORT_COUNT; index++)
    {
      if (ConnectorChange[index] == UCSI_CONNECTOR_CHANGE)
      {
        AsynchEventPending = (index + 1U);
        break;
      }
    }
  }
  return USBPD_OK;
}

/**
  * @brief  Enable Notification (Required)
  * @param  SetNotificationEnable Value of the SET_NOTIF_ENABLE
  * @retval None
  */
static USBPD_StatusTypeDef PPM_SetNotificationEnable(uint16_t SetNotificationEnable)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  PPM_Handle.SetNotificationEnable.NotificationEnable = SetNotificationEnable;

  return USBPD_OK;
}

/**
  * @brief  Acknowledge GET_CAPABILITY message (Required)
  * @retval None
  */
static USBPD_StatusTypeDef PPM_GetCapabilityStatus(void)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.DataLength                = 0x10U;
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* If the command completed successfully then PPM shall copy the
     capability in the message_in as described in table 4-13 GET_CAPABILITY Data */
  (void)memcpy(&PPM_Handle.MessageIn.Capability, &PPM_Handle.Capability, sizeof(UCSI_GET_CAPABILITY_IN_t));

  return USBPD_OK;
}

/**
  * @brief  Acknowledge GET_CONNECTOR_CAPABILITY message (Required)
  * @param  PortNumber Port Number value
  * @retval None
  */
static USBPD_StatusTypeDef PPM_GetConnectorCapabilityStatus(uint8_t PortNumber)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.DataLength                = 2U;
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* If the command completed successfully then PPM shall copy the
     capability in the message_in as described in table 4-13 GET_CAPABILITY Data */
  (void)memcpy(&PPM_Handle.MessageIn.ConnectorCapability, &PPM_Handle.ConnectorCapability[PortNumber],
         sizeof(UCSI_GET_CONNECTOR_CAPABILITY_IN_t));

  return USBPD_OK;
}


#if FEATURE_SET_UOM_SUPPORTED
/**
  * @brief  Set CC operation mode in USB-PD stack (Optional)
  * @param  PortNumber  Port Number value
  * @param  Mode  USB Mode can take the following value
  *               @arg UcsiCCOperationModeRpOnly
  *               @arg UcsiCCOperationModeRdOnly
  *               @arg UcsiCCOperationModeDrp
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_SetCC_OperationMode(uint8_t PortNumber, UCSI_CC_OPERATION_MODE_t Mode)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

