stm32mpu-oem/STM32CubeMP2/Middlewares/ST/STM32_USBPD_Library/UCSI/ppm.c
  /* Possible only if port is DRP */
  if (1U == DPM_Settings[PortNumber].PE_RoleSwap)
  {
    /* Save the CC operation mode */
    PPM_Handle.CC_Mode[PortNumber] = Mode;
  }
  else
  {
    PPM_Handle.AckCCI_Status.ErrorIndicator = 1U;
  }

  return USBPD_OK;
}
#endif /* FEATURE_SET_UOM_SUPPORTED */

/**
  * @brief  Set new USB operation role in USB-PD stack (Required)
  * @param  PortNumber  Port Number value
  * @param  Role  USB Role can take the following value
  *               @arg UcsiUsbOperationRoleDfp
  *               @arg UcsiUsbOperationRoleUfp
  *               @arg UcsiUsbOperationRoleAcceptSwap
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_SetUSB_OperationRole(uint8_t PortNumber, UCSI_USB_OPERATION_ROLE_t Role)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Save the USB operation mode */
  PPM_Handle.USB_Role[PortNumber] = Role;

  /* No effect and command failed:
     - if connector does not have an active connection */
  /* Check if device is connected or not */
  PPM_Handle.AckCCI_Status.ErrorIndicator  = 1U;

  /* Fields valid only in connect status set to 1 */
  if (DPM_Params[PortNumber].PE_IsConnected != 0U)
  {
    PPM_Handle.AckCCI_Status.ErrorIndicator  = 0U;
    /* No effect and command successfully:
     - if connector is already in the operation role   */
    if (((USBPD_PORTDATAROLE_UFP == DPM_Params[PortNumber].PE_DataRole)
         && ((UcsiUsbOperationRoleDfp | UcsiUsbOperationRoleAcceptSwap) == Role))
        || ((USBPD_PORTDATAROLE_DFP == DPM_Params[PortNumber].PE_DataRole)
            && ((UcsiUsbOperationRoleUfp | UcsiUsbOperationRoleAcceptSwap) == Role)))
    {
      /* Initiate a DR swap*/
      USBPD_DPM_RequestDataRoleSwap(PortNumber);
    }
  }
  /* Command should be compatible with current operation mode */

  return USBPD_OK;
}

#if FEATURE_SET_PDM_SUPPORTED
/**
  * @brief  Set new Power Direction mode in USB-PD stack (Optional)
  * @param  PortNumber  Port Number value
  * @param  PowerMode   Power direction Mode based on UCSI_POWER_DIRECTION_MODE_t
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_SetPowerDirectionMode(uint8_t PortNumber, UCSI_POWER_DIRECTION_MODE_t PowerMode)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Save the Power Direction Mode */
  PPM_Handle.PowerMode[PortNumber] = PowerMode;

  return USBPD_OK;
}
#endif /* FEATURE_SET_PDM_SUPPORTED */

/**
  * @brief  Set new Power Direction role in USB-PD stack (Required)
  * @param  PortNumber  Port Number value
  * @param  PowerRole   Power direction Mode based on UCSI_POWER_DIRECTION_ROLE_t
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_SetPowerDirectionRole(uint8_t PortNumber, UCSI_POWER_DIRECTION_ROLE_t PowerRole)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Save the Power Direction Role*/
  PPM_Handle.PowerRole[PortNumber] = PowerRole;

  /* Initiate a DR swap*/
  if (USBPD_OK != USBPD_DPM_RequestPowerRoleSwap(PortNumber))
  {
    PPM_Handle.AckCCI_Status.ErrorIndicator  = 1U;
  }
  return USBPD_OK;
}

#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
/**
  * @brief  Set new Power Direction role in USB-PD stack (Optional)
  * @param  PortNumber  Port Number value
  * @param  PtrGetAlternatesModes  Pointer to a get alternate modes command
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_GetAlternateModes(uint8_t PortNumber,
                                                  PUCSI_GET_ALTERNATE_MODES_COMMAND PtrGetAlternatesModes)
{
  USBPD_StatusTypeDef status = USBPD_OK;

  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Save the content of Get alternate modes */
  PPM_Handle.Control.GetAlternateModes.Recipient =
    (UCSI_GET_ALTERNATE_MODES_RECIPIENT_t)PtrGetAlternatesModes->Recipient;
  PPM_Handle.Control.GetAlternateModes.AlternateModeOffset = PtrGetAlternatesModes->AlternateModeOffset;
  /* Number of alternate modes to return starting from the alternate mode offset.
     Nb of alt mode to return is the value in this field plus 1
     => it means a value between 1 to 4                                           */
  PPM_Handle.Control.GetAlternateModes.NumberOfAlternateModes  = (PtrGetAlternatesModes->NumberOfAlternateModes + 1U);

  switch (PPM_Handle.Control.GetAlternateModes.Recipient)
  {
    case UcsiGetAlternateModesRecipientConnector:
    {
      PUCSI_GET_ALTERNATE_MODES_IN _ptr_altmode = &PPM_Handle.MessageIn.AlternateModes;
      /* Set the data length in Ack_CCI_Status
              => set to 4 times the nb of alt modes supported upt to a max of MAX_DATA_LENGTH */
      PPM_Handle.AckCCI_Status.DataLength =
        ((PPM_Handle.Control.GetAlternateModes.NumberOfAlternateModes * sizeof(UCSI_ALTERNATE_MODE)) >
         UCSI_MAX_DATA_LENGTH) ? UCSI_MAX_DATA_LENGTH :
        ((PPM_Handle.Control.GetAlternateModes.NumberOfAlternateModes * sizeof(UCSI_ALTERNATE_MODE)));
      /* Get information directly from the devices */
      _ptr_altmode->AlternateModes[0].Svid = 0x0015U; /* SVID available in VDM ID Header? */
      _ptr_altmode->AlternateModes[0].Mode = 0x000001FFU; /* SVID available in Discovery Mode? */
      _ptr_altmode->AlternateModes[1].Svid = 0x0015U;
      _ptr_altmode->AlternateModes[1].Mode = 0x000002FFU;
      break;
    }
    case UcsiGetAlternateModesRecipientSop:
      /* Send a VDM Discovery to SOP */
      /* TBI */
      break;
    case UcsiGetAlternateModesRecipientSopP:
      /* Send a VDM Discovery to SOP' */
      /* TBI */
      break;
    case UcsiGetAlternateModesRecipientSopPP:
      /* Send a VDM Discovery to SOP'' */
      /* TBI */
      break;
    default:
      status = USBPD_FAIL;
      break;
  }

