stm32mpu-oem/STM32CubeMP2/Middlewares/ST/STM32_USBPD_Library/UCSI/ppm.c
  return status;
}

/**
  * @brief  Manage reception of GET_CAM_SUPPORTED message (Optional)
  * @param  PortNumber  Port Number value
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_GetCamSupported(uint8_t PortNumber)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Return in the DataLength field if successful:
     => (Number of alternate modes Mod 8) + 1 */
  PPM_Handle.AckCCI_Status.DataLength = 1U;

  /* Fill the structure UCSI_GET_CAM_SUPPORTED_IN_t */
  /* !!! TBI !!! */
  PPM_Handle.MessageIn.CamSupported.bmAlternateModeSupported[0] = 0xAAU;

  return USBPD_OK;
}

/**
  * @brief  Manage reception of GET_CURRENT_CAM message (Optional)
  * @param  PortNumber  Port Number value
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_GetCurrentCam(uint8_t PortNumber)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Set length to 1 if successful */
  PPM_Handle.AckCCI_Status.DataLength = 1U;

  /* Fill the structure UCSI_GET_CURRENT_CAM_IN_t */
  /* !!! TBI !!! */
  PPM_Handle.MessageIn.CurrentCam.CurrentAlternateMode = 0xBBU;

  return USBPD_OK;
}

#if FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED
/**
  * @brief  Manage reception of SET_NEW_CAM message (Optional)
  * @param  PortNumber  Port Number value
  * @param  EnterOrExit PPM wants to enter (1U) or exit (0U) in this alternate mode
  * @param  NewCAM      Offset into the list of alternates modes that PPM wants to operate in
  * @param  AMSpecific  Content of the specific alternate mode (ex DP status)
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_SetNewCam(uint8_t PortNumber, uint8_t EnterOrExit, uint8_t NewCAM, uint32_t AMSpecific)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* !!! TBI !!! */

  return USBPD_OK;
}
#endif /* FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED */
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */

#if FEATURE_PDODETAILS_SUPPORTED
/**
  * @brief  Manage reception of GET_PDOS message (Optional)
  * @param  PortNumber  Port Number value
  * @param  PtrGetPdos  Pointer to the UCSI_GET_PDOS_COMMAND structure
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_GetPDOs(uint8_t PortNumber, PUCSI_GET_PDOS_COMMAND_t PtrGetPdos)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  uint8_t nbPDO;
  uint8_t maxnbPDOSNK;
  uint8_t maxnbPDOSRC;
  uint32_t *ptrListPDOSRC;
  uint32_t *ptrListPDOSNK;

  /* Retrieve the PDOs associated with the connector */
  if (PtrGetPdos->PartnerPdo == 0U)
  {
#if defined (_GUI_INTERFACE)
    maxnbPDOSNK = USBPD_NbPDO[0];
    maxnbPDOSRC = USBPD_NbPDO[1];
#else
    maxnbPDOSNK = (uint8_t)PORT0_NB_SINKPDO;
    maxnbPDOSRC = (uint8_t)PORT0_NB_SINKPDO;
#endif /* _GUI_INTERFACE */
    ptrListPDOSRC = PORT0_PDO_ListSRC;
    ptrListPDOSNK = PORT0_PDO_ListSNK;
  }
  /* Retrieve the PDOs of the device attached to the connector */
  else
  {
    maxnbPDOSNK = (uint8_t)DPM_Ports[PortNumber].DPM_NumberOfRcvSNKPDO;
    maxnbPDOSRC = (uint8_t)DPM_Ports[PortNumber].DPM_NumberOfRcvSRCPDO;
    ptrListPDOSRC = DPM_Ports[PortNumber].DPM_ListOfRcvSRCPDO;
    ptrListPDOSNK = DPM_Ports[PortNumber].DPM_ListOfRcvSNKPDO;
  }

  if (PtrGetPdos->SourceOrSinkPdos == UcsiGetPdosTypeSource)
  {
    /* Get the min between the asked number of PDOs and the available source PDOs after offset to avoid overflow */
    nbPDO = MIN((PtrGetPdos->NumberOfPdos + 1U), maxnbPDOSRC - PtrGetPdos->PdoOffset);
  }
  else
  {
    /* Get the min between the asked number of PDOs and the available sink PDOs after offset to avoid overflow  */
    nbPDO = MIN((PtrGetPdos->NumberOfPdos + 1U), maxnbPDOSNK - PtrGetPdos->PdoOffset);
  }

  /* DataLength field is 4 x Number of PDOs up to UCSI_MAX_DATA_LENGTH */
  if ((4U * nbPDO) > UCSI_MAX_DATA_LENGTH)
  {
    nbPDO = UCSI_MAX_DATA_LENGTH / 4U;
  }
  PPM_Handle.AckCCI_Status.DataLength = 4U * nbPDO;

  /* Reset the returned PDOs */
  memset(PPM_Handle.MessageIn.Pdos.Pdos, 0x00U, sizeof(PPM_Handle.MessageIn.Pdos.Pdos));

  /* Fill the structure UCSI_GET_PDOS_IN_t */
  if (PtrGetPdos->SourceOrSinkPdos == UcsiGetPdosTypeSource)
  {
    memcpy(PPM_Handle.MessageIn.Pdos.Pdos, ptrListPDOSRC + PtrGetPdos->PdoOffset, sizeof(uint32_t) * nbPDO);
  }
  else
  {
    memcpy(PPM_Handle.MessageIn.Pdos.Pdos, ptrListPDOSNK + PtrGetPdos->PdoOffset, sizeof(uint32_t) * nbPDO);
  }

  return USBPD_OK;
}
#endif /* FEATURE_PDODETAILS_SUPPORTED */

#if FEATURE_CABLEDETAILS_SUPPORTED
/**
  * @brief  Manage reception of GET_CABLE_PROPERTY message (Optional)
  * @param  PortNumber  Port Number value
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_GetCableProperty(uint8_t PortNumber)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Return 5 in the DataLength field if successful */
  PPM_Handle.AckCCI_Status.DataLength = 5U;

  /* Fill the structure UCSI_GET_CABLE_PROPERTY_IN */
  /* !!! TBI !!! */
  PPM_Handle.MessageIn.CableProperty.bmSpeedSupported.SpeedExponent = 1U;
  PPM_Handle.MessageIn.CableProperty.bmSpeedSupported.Mantissa      = 0x3FU;
  PPM_Handle.MessageIn.CableProperty.bCurrentCapability = 0xAAU;
  PPM_Handle.MessageIn.CableProperty.VBusInCable        = 1U;
  /* 1: Active cable, 0: Passive cable */
  PPM_Handle.MessageIn.CableProperty.CableType          = 1U;
  PPM_Handle.MessageIn.CableProperty.Directionality     = 1U;
  /* 0: USB-Type-A, 1: USB-Type-B, 2: USB-Type-C, 3: Other (not USB) */
  PPM_Handle.MessageIn.CableProperty.PlugEndType        = CABLE_TO_TYPE_C;
  /* 0: no support of alternate mode, 1: Support of alternate mode */
  PPM_Handle.MessageIn.CableProperty.ModeSupport        =  1U;
  /* Check table 6-28 from USB-PD 2.0 spec */
  PPM_Handle.MessageIn.CableProperty.Latency            = CABLE_LATENCY_60NS;

  return USBPD_OK;
}
#endif /* FEATURE_CABLEDETAILS_SUPPORTED */

/**
  * @brief  Get the connector status (Required)
  * @param  PortNumber  Port Number value
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_GetConnectorStatus(uint8_t PortNumber)
{
  PUCSI_GET_CONNECTOR_STATUS_IN_t p_connector_status = &PPM_Handle.MessageIn.ConnectorStatus;

  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.DataLength = 0x09U;

  /* Fill ConnectorStatusChange if a new connector change has been notified */
  if (ConnectorChange[PortNumber] == UCSI_CONNECTOR_CHANGE)
  {
    /* Fill the ConnectorStatusChange */
    p_connector_status->ConnectorStatusChange.AsUInt16                            = 0x0000U;
#if FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED
    p_connector_status->ConnectorStatusChange.ExternalSupplyChange                = 0U;
#endif /* FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED */
    p_connector_status->ConnectorStatusChange.PowerOperationModeChange            = 1U;
    p_connector_status->ConnectorStatusChange.SupportedProviderCapabilitiesChange = 0U;
    p_connector_status->ConnectorStatusChange.NegotiatedPowerLevelChange          = 0U;
#if FEATURE_PDRESETNOTIFICATION_SUPPORTED
    p_connector_status->ConnectorStatusChange.PdResetComplete                     = 0U;
#endif /* FEATURE_PDRESETNOTIFICATION_SUPPORTED */
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
    p_connector_status->ConnectorStatusChange.SupportedCamChange                  = 0U;
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
    p_connector_status->ConnectorStatusChange.BatteryChargingStatusChange         = 0U;
    p_connector_status->ConnectorStatusChange.ConnectorPartnerChange              = 0U;
    p_connector_status->ConnectorStatusChange.PowerDirectionChange                = 1U;
    p_connector_status->ConnectorStatusChange.ConnectChange                       = 1U;
    p_connector_status->ConnectorStatusChange.Error                               = 0U;
  }

