stm32mpu-oem/STM32CubeMP2/Middlewares/ST/STM32_USBPD_Library/UCSI/ppm.c
  /* Reset current notification */
  ConnectorChange[PortNumber] = UCSI_CONNECTOR_IDLE;

  /* Check if device is connected or not */
  p_connector_status->ConnectStatus = (uint16_t)DPM_Params[PortNumber].PE_IsConnected;

  /* Fields valid only in connect status set to 1 */
  if (p_connector_status->ConnectStatus != 0U)
  {
    if (USBPD_POWER_EXPLICITCONTRACT == DPM_Params[PortNumber].PE_Power)
    {
      p_connector_status->PowerOperationMode = UcsiPowerOperationModePd;
    }
    else
    {
      p_connector_status->PowerOperationMode = UcsiPowerOperationModeDefaultUsb;
      if (USBPD_PORTPOWERROLE_SNK == DPM_Params[PortNumber].PE_PowerRole)
      {
        p_connector_status->PowerOperationMode = UcsiPowerOperationModeDefaultUsb;
        if (vRd_3_0A == DPM_Params[PortNumber].SNKExposedRP_AtAttach)
        {
          p_connector_status->PowerOperationMode = UcsiPowerOperationModeTypeC3000;
        }
        else
        {
          if (vRd_1_5A == DPM_Params[PortNumber].SNKExposedRP_AtAttach)
          {
            p_connector_status->PowerOperationMode = UcsiPowerOperationModeTypeC1500;
          }
        }
      }
    }
    p_connector_status->PowerDirection = (UCSI_POWER_DIRECTION_t)(USBPD_PORTPOWERROLE_SRC ==
                                                                  DPM_Params[PortNumber].PE_PowerRole);

    p_connector_status->ConnectorPartnerFlags = (uint16_t)UcsiConnectorPartnerFlagUsb;

#if defined(_VDM)
    if (DPM_Settings[PortNumber].PE_VDMSupport = USBPD_TRUE)
    {
      p_connector_status->ConnectorPartnerFlags |= UcsiConnectorPartnerFlagAlternateMode;
    }
#endif /* _VDM */

    /* Need to get information if cable is connected or not (information from CAD) */
    if (USBPD_PORTDATAROLE_UFP == DPM_Params[PortNumber].PE_DataRole)
    {
      p_connector_status->ConnectorPartnerType  = UcsiConnectorPartnerTypeDfp;
    }
    else
    {
      p_connector_status->ConnectorPartnerType  = UcsiConnectorPartnerTypeUfp;
    }

    if (UcsiPowerDirectionConsumer == p_connector_status->PowerDirection)
    {
      p_connector_status->BatteryChargingStatus     = UcsiBatteryChargingNotCharging;
    }
    else
    {
      p_connector_status->bmPowerBudgetLimitedReason.PowerBudgetLowered       = 0U;
      p_connector_status->bmPowerBudgetLimitedReason.ReachingPowerBudgetLimit = 0U;
    }
  }
  else
  {
    p_connector_status->PowerOperationMode        = UcsiPowerOperationModeNoConsumer;
    p_connector_status->PowerDirection            = UcsiPowerDirectionConsumer;
    p_connector_status->ConnectorPartnerFlags     = 0U;
    p_connector_status->ConnectorPartnerType      = UcsiConnectorPartnerUnknown;
    p_connector_status->BatteryChargingStatus     = UcsiBatteryChargingNotCharging;
    p_connector_status->PowerBudgetLimitedReason  = 0U;

  }

#if FEATURE_PDODETAILS_SUPPORTED
  /* Field valid only in connect status set to 1 and power operation mode is set to PD */
  if ((p_connector_status->ConnectStatus != 0U) && (UcsiPowerOperationModePd == p_connector_status->PowerOperationMode))
  {
    /* Return the negotiated power level */
    USBPD_PWR_IF_SearchRequestedPDO(PortNumber, DPM_Ports[PortNumber].DPM_RDOPosition,
                                    &p_connector_status->RequestDataObject);
  }
  else
#endif /* FEATURE_PDODETAILS_SUPPORTED */
  {
    p_connector_status->RequestDataObject     = 0U;
  }
  return USBPD_OK;
}

/**
  * @brief  Manage reception of GET_ERROR_STATUS message (Required)
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_GetErrorStatus(void)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;

  PPM_Handle.AckCCI_Status.DataLength = UCSI_GET_ERROR_STATUS_DATA_LENGTH;

  return USBPD_OK;
}
#if FEATURE_SET_POWER_LEVEL_SUPPORTED
/**
  * @brief  Manage reception of SET POWER LEVEL message (Optional)
  * @note Command used by OPM to set the max negiable power level of Sink
  *           or Source
  * @param  PtrSetPowerLevel  Pointer on Set Power Level Command
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_SetPowerLevel(PUCSI_SET_POWER_LEVEL_COMMAND PtrSetPowerLevel)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;

  /* Command has no effect and set Error information to Invalid Command (InvalidCommandParametersError):
      - no active connection
      - Power direction does not match */

  /* If command is valid, complete the command and renegotiate a power contract is necessary */
  return USBPD_OK;
}
#endif /* FEATURE_SET_POWER_LEVEL_SUPPORTED */

#if FEATURE_GET_PD_MESSAGE_SUPPORTED
/**
  * @brief  Manage reception of GET PD MESSAGE message (Optional)
  * @param  PtrGetPDMessage  Pointer on Get PD Message Command
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_GetPDMessage(PUCSI_GET_PD_MESSAGE_COMMAND PtrGetPDMessage)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;

  return USBPD_OK;
}
#endif /* FEATURE_GET_PD_MESSAGE_SUPPORTED */

/**
  * @brief  Manage reception of Unknown command message (Required)
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_UnknownCommand(uint8_t PortNumber)
{
  PUCSI_GET_ERROR_STATUS_IN_t p_error_status;

  if (PortNumber >= USBPD_PORT_COUNT)
  {
    PPM_DEBUG(PPM_DEBUG_LEVEL_0, 0U, "UnknownCommand WRONG PORT");
  }

  p_error_status = &PPM_Handle.MessageIn.ErrorStatus;
  p_error_status->ErrorInformation.AsUInt16                 = 0U;
  p_error_status->ErrorInformation.UnrecognizedCommandError = 1U;

  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator  = 1U;
  PPM_Handle.AckCCI_Status.NotSupportedIndicator      = 1U;

  return USBPD_OK;
}

/**
  * @brief  Fill the default configuration used by the USB-PD stack
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_FillDefaultConfiguration(void)
{
  USBPD_StatusTypeDef status = USBPD_OK;

