stm32mpu-oem/STM32CubeMP2/Middlewares/ST/STM32_USBPD_Library/UCSI/ppm.c
  PUCSI_VERSION_t _version = &PPM_Handle.UcsiVersion;

  /* UCSI revision 1.2 (January 2020) */
  _version->MajorVersion    = 0x1U;
  _version->MinorVersion    = 0x2U;
  _version->SubMinorVersion = 0x0U;

  PUCSI_GET_CAPABILITY_IN_t _pcabability = &PPM_Handle.Capability;

  /* Fill the capability bmAttributes */
  _pcabability->bmAttributes.DisabledStateSupport  = 1U;
  _pcabability->bmAttributes.BatteryCharging       = 0U;
  _pcabability->bmAttributes.UsbPowerDelivery      = 1U;
  _pcabability->bmAttributes.UsbTypeCCurrent       = 1U;
  _pcabability->bmAttributes.bmPowerSource         = (1U << 6); /* Uses VBUS */

  /* Fill the Number of connectors */
  _pcabability->bNumConnectors  = USBPD_PORT_COUNT;

  /* Fill the capability bmOptionalFeatures */
  bmOptionalFeatures_t feature;
  feature.AsUInt32 = 0U;
  feature.SetCComSupported                     = FEATURE_SET_UOM_SUPPORTED;
  feature.SetPowerLevelSupported               = FEATURE_SET_POWER_LEVEL_SUPPORTED;
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
  feature.AlternateModeDetailsSupported        = FEATURE_ALTERNATEMODEDETAILS_SUPPORTED;
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
#if FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED
  feature.AlternateModeOverrideSupported       = FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED;
#endif /* FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED */
  feature.PdoDetailsSupported                  = FEATURE_PDODETAILS_SUPPORTED;
  feature.CableDetailsSupported                = FEATURE_CABLEDETAILS_SUPPORTED;
  feature.ExternalSupplyNotificationSupported  = FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED;
  feature.PdResetNotificationSupported         = FEATURE_PDRESETNOTIFICATION_SUPPORTED;
  feature.GetPDMessageSupported                = FEATURE_GET_PD_MESSAGE_SUPPORTED;
  _pcabability->OptionalFeatures = feature.AsUInt32;

  /* Fill the Number of supported alternate modes */
#if defined(_VDM)
  _pcabability->bNumAltModes  = 1U;
#else
  _pcabability->bNumAltModes  = 0U;
#endif /* _VDM */

  /* Fill Battery Charging Specification Release number */
  _pcabability->bcdBcVersion  = 0x0000U;

  /* Fill USB-PD Specification Release number */
  if (USBPD_SPECIFICATION_REV2 == DPM_Settings[USBPD_PORT_0].PE_SpecRevision)
  {
    _pcabability->bcdPdVersion  = 0x0200U;
  }
  else
  {
    _pcabability->bcdPdVersion  = 0x0300U;
  }

  /* Fill USB-Type C Specification Release number */
  _pcabability->bcdUsbTypeCVersion  = 0x0200U;

  return status;
}

/**
  * @brief  Fill the connector capability configuration used by the USB-PD stack
  * @param  PortNumber    PortNumber number value
  * @param  _pcabability  Pointer on UCSI_GET_CONNECTOR_CAPABILITY_IN structure
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_FillConnectorCapability(uint8_t PortNumber,
                                                       PUCSI_GET_CONNECTOR_CAPABILITY_IN_t PtrConnectorCapability)
{
  USBPD_StatusTypeDef status = USBPD_OK;

  /* Fill the connector capability OperationMode */
  if (1U == DPM_Settings[PortNumber].PE_RoleSwap)
  {
    /* Allow OPM to request a DRS as defined port is defined as DRD
          Port defined as TYPEC_PORT_DRD on OPM side */
    PtrConnectorCapability->OperationMode.Drp                = 1U;
    /* Does not care but set to 1 anyway */
    PtrConnectorCapability->OperationMode.RpOnly             = 1U;
    PtrConnectorCapability->OperationMode.RdOnly             = 1U;
  }
  else
  {
    /* DRS not supported */
    PtrConnectorCapability->OperationMode.Drp                 = 0U;
    /* Check default Data role of port */
    if (USBPD_PORTPOWERROLE_SRC == DPM_Settings[PortNumber].PE_DefaultRole)
    {
      /* Port defined as TYPEC_PORT_DFP on OPM side */
      PtrConnectorCapability->OperationMode.RpOnly             = 1U;
      PtrConnectorCapability->OperationMode.RdOnly             = 0U;
    }
    else
    {
      /* Port defined as TYPEC_PORT_UFP on OPM side */
      PtrConnectorCapability->OperationMode.RpOnly             = 0U;
      PtrConnectorCapability->OperationMode.RdOnly             = 1U;
    }
  }
  PtrConnectorCapability->OperationMode.AudioAccessoryMode  = 0U;
  PtrConnectorCapability->OperationMode.DebugAccessoryMode  = 0U;

  /* Retrieve if USB is supported from first PDO */
  if ((PORT0_PDO_ListSRC[0U] & USBPD_PDO_SRC_FIXED_USBCOMM_SUPPORTED) != 0U)
  {
    PtrConnectorCapability->OperationMode.Usb2              = 0U;
  }
  PtrConnectorCapability->OperationMode.Usb3                = 0U;
  PtrConnectorCapability->OperationMode.AlternateMode       = (uint8_t)DPM_Settings[PortNumber].PE_VDMSupport;

  /* Fill the connector capability Provider/Consumer */
  if (1U == DPM_Settings[PortNumber].PE_RoleSwap)
  {
    /* Port defined as TYPEC_PORT_DRP on OPM side */
    PtrConnectorCapability->Provider       = 1U;
    PtrConnectorCapability->Consumer       = 1U;

    /* Power Role Swap supported */
    PtrConnectorCapability->SwapToSRC      = 1U;
    PtrConnectorCapability->SwapToSNK      = 1U;
  }
  else
  {
    if (USBPD_PORTPOWERROLE_SRC == DPM_Settings[PortNumber].PE_DefaultRole)
    {
      /* Port defined as TYPEC_PORT_SRC on OPM side */
      PtrConnectorCapability->Provider       = 1U;
      PtrConnectorCapability->Consumer       = 0U;
    }
    else
    {
      /* Port defined as TYPEC_PORT_SNK on OPM side */
      PtrConnectorCapability->Provider       = 0U;
      PtrConnectorCapability->Consumer       = 1U;
    }

    /* Power Role Swap not supported */
    PtrConnectorCapability->SwapToSRC      = 1U;
    PtrConnectorCapability->SwapToSNK      = 1U;
  }

  /* Fill the connector capability Data Role Support */
  PtrConnectorCapability->SwapToDFP = (uint8_t)DPM_USER_Settings[PortNumber].PE_DR_Swap_To_DFP;
  PtrConnectorCapability->SwapToUFP = (uint8_t)DPM_USER_Settings[PortNumber].PE_DR_Swap_To_UFP;

  return status;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
